package com.kh.poly.pack1.dto.service;

public class 다형성 {
    /*
    * 다형성 polymorphism
    * 하나의 성질이 여러 특성으로 나타남
    * 하나의 이름이나 형태가 다양한 동작으로 변화할 수 있는 성질
    *
    * 컴파일 시간 다형성 : 메서드 오버로딩 overloading
    * (over: 위에,초과 load: 부담,짐을 싣다 ) -> 메서드 이름 하나에 여러역할 부여해 과부하 주는것처럼 보여서 생긴 이름
    *               메서드 이름은 같아도 매개변수 개수나 타입 다를때 적용
    * 실행 시간 다형성 : 메서드 오버라이딩 overriding
    * (over: 위에,초과 ride: 타다,지배하다  ) -> 기존 동작 덮어쓰고 새 동작 정의해서 생긴 이름
    *                 상속관계에서 부모 클래스 기능을 자식 클래스이 다시 재정의 해서
    *               자신만의 동작으로 기능 재설정할 때 사용
    *                 목소리->부모님한테 받은 능력에서 내 능력으로 재탄생
    *                상속-> 받은 재산,유물등을 내 능력으로 소진하거나 증가시켜 재탄생시킴
    *
    *
    * */
}
