package com.kh.oop.methodex;
/*
* [파라미터 = 매개변수]
* 중간에 개입해 변수 둔다
* 메서드 호출시 전달된 데이터를 메서드 내부에서 사용하는 변수명
* 메서드가 외부 데이터 받아 작업하게 진행
* 매개변수는 타입과 이름 정의
* 자바스크립트는 변수명만 작성 function 기능명(매개변수명) {}
* 자바는 타입명과 변수명 모두 작성하기 public void 기능명(자료형 매개변수명) {]
*
* [보이드]
* 자바에서 메서드가 값 반환 안할때 사용
* 작업 수행만 하고 결과를 호출한 쪽에 안넘겨줌
* 예 : 화면에 메시지 출력, 데이터 저장
*
* [리턴]
* 메서드가 값 호출한쪽으로 반환
* 반환값을 다른 메서드에서 활용, 변수에 저장
* 반환타입이 보이드가 아니면 메서드 내부에 반드시 마지막에 리턴 키워드 필요
* 보이드 자리에 리턴으로 어떤 자료형 반환할지 자료형 작성
*
*
*
* */
public class Void_Return_Parameters {
}
